app/controllers/main_controller.rb

INSERT INTO "records" ("subject", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["subject", "a"], ["score", 50.0], ["created_at", "2022-09-22 05:32:57.705644"], ["updated_at", "2022-09-22 05:32:57.705644"]]
SELECT "records".* FROM "records"
---
  def result
    for i in 1..$gnum do
      record = Record.new
      record.subject = $listsub[i-1]
      record.score = $listnum[i-1]
      record.save
    end

    lsub = []
    lnum = []
    for e in Record.all do