app/controllers/score_controller.rb

SELECT "records".* FROM "records"
---
  def list

    @records = Record.all

SELECT "records".* FROM "records" WHERE "records"."id" = ?  [["id", 22]]
---
  def edit
    if params[:select]
      @id = params[:id]
      @subject = Record.find(@id).subject
      @score = Record.find(@id).score
    else
      @id = params[:id]
      @t = Record.find(@id)

DELETE FROM "records" WHERE "records"."id" = ?  [["id", 22]]
---
  def delete
    Record.destroy_by(id: params[:id])